tap "argoproj/tap"
tap "cloudflare/cloudflare"
tap "felixkratz/formulae"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "oven-sh/bun"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "weaveworks/tap"
tap "yakitrak/yakitrak"
brew "giflib"
brew "highway"
brew "libpng"
brew "openssl@3"
brew "argocd"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "libssh2"
brew "bat"
brew "glib"
brew "cairo"
brew "bazel"
brew "bear"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "pkgconf"
brew "pango"
brew "librsvg"
brew "chezmoi"
brew "cloudflared", restart_service: :changed, link: false
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "deno"
brew "dive"
brew "duckdb"
brew "duf"
brew "emscripten"
brew "exiftool"
brew "faiss"
brew "fastfetch"
brew "terminal-notifier"
brew "fastlane"
brew "ffmpeg"
brew "flyctl"
brew "freetds"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "helix"
brew "helm"
brew "htop"
brew "ios-deploy"
brew "iredis"
brew "jj"
brew "jpeg"
brew "jq"
brew "jupyterlab"
brew "k6"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "lazygit"
brew "libpq"
brew "llvm"
brew "maven"
brew "mycli"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "octave"
brew "open-ocd"
brew "opencc"
brew "opencv"
brew "openssh"
brew "p7zip"
brew "php"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "pygobject3"
brew "python@3.10"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "scons"
brew "smartdns"
brew "speedtest-cli"
brew "starship"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "unar"
brew "uv"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yazi"
brew "ykman"
brew "zoxide"
brew "zsh"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "felixkratz/formulae/sketchybar"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/yabai"
brew "nats-io/nats-tools/nats"
brew "oven-sh/bun/bun"
brew "steipete/tap/gifgrep"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "stripe/stripe-cli/stripe"
brew "weaveworks/tap/eksctl"
brew "yakitrak/yakitrak/obsidian-cli"
cask "steipete/tap/codexbar"
cask "emacs-app"
cask "font-hack-nerd-font"
cask "gcc-arm-embedded"
cask "gcloud-cli"
cask "hammerspoon"
cask "hyper"
cask "jordanbaird-ice"
cask "keycastr"
cask "lyricsx"
cask "orbstack"
cask "rar"
cask "wezterm"
cask "xscreensaver"
