tap "argoproj/tap"
tap "cloudflare/cloudflare"
tap "felixkratz/formulae"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "oven-sh/bun"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "weaveworks/tap"
tap "yakitrak/yakitrak"
brew "giflib"
brew "highway"
brew "libpng"
brew "openssl@3"
brew "argocd"
brew "python@3.11"
brew "autojump"
brew "automake"
brew "libssh2"
brew "bat"
brew "glib"
brew "cairo"
brew "bazel"
brew "bear"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "pkgconf"
brew "pango"
brew "librsvg"
brew "chezmoi"
brew "cloudflared", restart_service: :changed, link: false
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "deno"
brew "dive"
brew "duckdb"
brew "duf"
brew "emscripten"
brew "exiftool"
brew "faiss"
brew "fastfetch"
brew "terminal-notifier"
brew "fastlane"
brew "ffmpeg"
brew "flyctl"
brew "freetds"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "helix"
brew "helm"
brew "htop"
brew "ios-deploy"
brew "iredis"
brew "jj"
brew "jpeg"
brew "jq"
brew "jupyterlab"
brew "k6"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "lazygit"
brew "libpq"
brew "llvm"
brew "maven"
brew "mycli"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "octave"
brew "open-ocd"
brew "opencc"
brew "opencv"
brew "openssh"
brew "p7zip"
brew "php"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "pygobject3"
brew "python@3.10"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "scons"
brew "smartdns"
brew "speedtest-cli"
brew "starship"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "unar"
brew "uv"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yazi"
brew "ykman"
brew "zoxide"
brew "zsh"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "felixkratz/formulae/sketchybar"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/yabai"
brew "nats-io/nats-tools/nats"
brew "oven-sh/bun/bun"
brew "steipete/tap/gifgrep"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "stripe/stripe-cli/stripe"
brew "weaveworks/tap/eksctl"
brew "yakitrak/yakitrak/obsidian-cli"
cask "steipete/tap/codexbar"
cask "emacs-app"
cask "font-hack-nerd-font"
cask "gcc-arm-embedded"
cask "gcloud-cli"
cask "hammerspoon"
cask "hyper"
cask "jordanbaird-ice"
cask "keycastr"
cask "lyricsx"
cask "orbstack"
cask "rar"
cask "wezterm"
cask "xscreensaver"
vscode "acarreiro.calculate"
vscode "alefragnani.bookmarks"
vscode "amlovey.shaderlabvscodefree"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "banacorn.agda-mode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "chenglou92.rescript-vscode"
vscode "chrislajoie.vscode-modelines"
vscode "cl.eide"
vscode "cpylua.language-postcss"
vscode "cquery-project.cquery"
vscode "cweijan.vscode-office"
vscode "dan-c-underwood.arm"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "drblury.protobuf-vsc"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "evidence.evidence-vscode"
vscode "evzen-wybitul.magic-racket"
vscode "fabiospampinato.vscode-diff"
vscode "freebroccolo.sml"
vscode "geequlim.godot-tools"
vscode "gimly81.matlab"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "herrmannplatz.npm-dependency-links"
vscode "idered.npm"
vscode "j-mueller.agda"
vscode "jaaxxx.bun-lockb"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "jasonnutter.search-node-modules"
vscode "jinliming2.vscode-go-template"
vscode "jjk.jjk"
vscode "jock.svg"
vscode "josetr.cmake-language-support-vscode"
vscode "jota0222.multi-formatter"
vscode "juanblanco.solidity"
vscode "justusadam.language-haskell"
vscode "kdl-org.kdl"
vscode "kilocode.kilo-code"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lencerf.beancount"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "lokalise.i18n-ally"
vscode "marclipovsky.string-manipulation"
vscode "marus25.cortex-debug"
vscode "mathiasfrohlich.kotlin"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "mike-lischke.vscode-antlr4"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "mrkou47.thrift-syntax-support"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.js-atom-grammar"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-speech-language-pack-zh-cn"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pgourlain.erlang"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "prisma.prisma"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "raczzalan.webgl-glsl-editor"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "typescriptteam.native-preview"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentin.beamdasm"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wokwi.wokwi-vscode"
vscode "xlthu.pangu-markdown"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "zjcompt.es6-string-javascript"
go "github.com/air-verse/air"
go "github.com/databendcloud/bend-ingest-kafka"
go "github.com/Dreamacro/clash"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/gofiber/cli/fiber"
go "github.com/ramya-rao-a/go-outline"
go "golang.org/x/tools/cmd/goimports"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/mitranim/gow"
go "github.com/vadimi/grpc-client-cli/cmd/grpc-client-cli"
go "github.com/josharian/impl"
go "github.com/charmbracelet/mods"
go "github.com/zu1k/nali"
go "github.com/aushq/gdp/cmd/protoc-gen-gd"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/pranshuparmar/witr/cmd/witr"
cargo "ast-grep"
cargo "bob-nvim"
cargo "cargo-binstall"
cargo "cargo-update"
cargo "jj-cli"
cargo "mise"
cargo "slumber"
cargo "zellij"
uv "pdm"
